In [3]:
import pandas as pd
import numpy as np

In [52]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [53]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

1.Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).

In [54]:
df['FlightNumber'].fillna(0,inplace=True)

In [55]:
df['FlightNumber']=df['FlightNumber']+10

In [56]:
df['FlightNumber'].astype('float')

0    10055.0
1       10.0
2    10075.0
3       10.0
4    10095.0
Name: FlightNumber, dtype: float64

In [57]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   From_To       5 non-null      object
 1   FlightNumber  5 non-null      float64
 2   RecentDelays  5 non-null      object
 3   Airline       5 non-null      object
dtypes: float64(1), object(3)
memory usage: 288.0+ bytes

2. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.

In [58]:
df[['From','To']] = df.From_To.str.split("_",expand=True,)

In [59]:
df

            From_To  FlightNumber  ...      From         To
0      LoNDon_paris       10055.0  ...    LoNDon      paris
1      MAdrid_miLAN          10.0  ...    MAdrid      miLAN
2  londON_StockhOlm       10075.0  ...    londON  StockhOlm
3    Budapest_PaRis          10.0  ...  Budapest      PaRis
4   Brussels_londOn       10095.0  ...  Brussels     londOn

[5 rows x 6 columns]

3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)

In [60]:
df['From'].apply(lambda x: x.lower()).str.capitalize()

0      London
1      Madrid
2      London
3    Budapest
4    Brussels
Name: From, dtype: object

In [61]:
df['To'].apply(lambda x: x.lower()).str.capitalize()

0        Paris
1        Milan
2    Stockholm
3        Paris
4       London
Name: To, dtype: object

4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.

In [62]:
df.drop('From_To',axis=1,inplace=True)
df

   FlightNumber  RecentDelays              Airline      From         To
0       10055.0      [23, 47]               KLM(!)    LoNDon      paris
1          10.0            []    <Air France> (12)    MAdrid      miLAN
2       10075.0  [24, 43, 87]  (British Airways. )    londON  StockhOlm
3          10.0          [13]       12. Air France  Budapest      PaRis
4       10095.0      [67, 32]          "Swiss Air"  Brussels     londOn

5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each
second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.

Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.

In [65]:
delays = df['RecentDelays'].apply(pd.Series)
delays.columns = ['delay_{}'.format(n) for n in range(1, len(delays.columns)+1)]
df = df.drop('RecentDelays', axis=1).join(delays)

In [66]:
df

   FlightNumber              Airline      From  ... delay_1  delay_2  delay_3
0       10055.0               KLM(!)    LoNDon  ...    23.0     47.0      NaN
1          10.0    <Air France> (12)    MAdrid  ...     NaN      NaN      NaN
2       10075.0  (British Airways. )    londON  ...    24.0     43.0     87.0
3          10.0       12. Air France  Budapest  ...    13.0      NaN      NaN
4       10095.0          "Swiss Air"  Brussels  ...    67.0     32.0      NaN

[5 rows x 7 columns]